In [1]:
import sqlite3

In [3]:
# connect to SQLite database
conection = sqlite3.connect('example.db')

In [5]:
# make a cursor for iterate table or row or columns
cursor = conection.cursor()

In [8]:
# Create a table
cursor.execute('''
    Create Table if Not Exists Students(
        id Integer Primary Key,
        name Text Not Null,
        age Integer,
        department text
    )
''')

# commiting this changes
conection.commit()

In [13]:
# select all
cursor.execute('''
    select * from students
''')

In [12]:
# insert the data in sqlite3
cursor.execute(
'''
    insert into students(name, age, department)  values
    ('Shimul', 25, 'CSE'),
    ('A. Rahman', 24, 'EEE'),
    ('Eleush', 35, 'ETE'),
    ('Zahan', 25, 'CSE')
'''
)

conection.commit()

In [23]:
# Query any data from the students table
cursor.execute('select * from students')
rows = cursor.fetchall()
rows

[(1, 'Shimul', 25, 'CSE'),
 (2, 'A. Rahman', 24, 'EEE'),
 (3, 'Eleush', 35, 'ETE'),
 (5, 'Alif', 23, 'MAT'),
 (6, 'Jim', 22, 'STA'),
 (7, 'Jamila', 35, 'CSE'),
 (8, 'Sohan', 25, 'ARC')]

In [20]:
cursor.execute('''
    UPDATE students 
    SET name = 'Alif', age = 23, department = 'MAT' 
    WHERE id = 5;
''')

cursor.execute('''
    UPDATE students 
    SET name = 'Jim', age = 22, department = 'STA' 
    WHERE id = 6;
''')

cursor.execute('''
    UPDATE students 
    SET name = 'Jamila', department = 'CSE' 
    WHERE id = 7;
''')

cursor.execute('''
    UPDATE students 
    SET name = 'Sohan', department = 'ARC' 
    WHERE id = 8;
''')

# Commit the changes to the database
conection.commit()

In [22]:
# delete the aata from the table
cursor.execute('''
    delete from students
    where id=4
''')

# Commit the changes to the database
conection.commit()

In [27]:
rows

for row in rows:
    print(row)

(1, 'Shimul', 25, 'CSE')
(2, 'A. Rahman', 24, 'EEE')
(3, 'Eleush', 35, 'ETE')
(5, 'Alif', 23, 'MAT')
(6, 'Jim', 22, 'STA')
(7, 'Jamila', 35, 'CSE')
(8, 'Sohan', 25, 'ARC')